#include "MCprotocolData.hpp"

char buf[] = {
    0x50,0x00,      // サブヘッダ
    0x00,           // ネットワーク番号（アクセス経路）
    0xFF,           // PC番号（アクセス経路）
    0xFF,0x03,      // 要求先ユニットI/O番号(アクセス経路)
    0x00,           // 要求ユニット局番号 (アクセス経路)
    0x00,0x18,      // 要求データ長
    0x20,0x00,      // 監視タイマ
    0x01,0x04,      // コマンド
    0x00,0x00,      // サブコマンド
    0x00,0x00,0x64, // 先頭デバイス番号
    0xA8,           // デバイスコード
    0x09,0x00,      // デバイス点数
};

char bufTest[] = {
    0x16,                // サブヘッダ
    0xff,                // PC番号（アクセス経路）
    0x00,0x00,           // 監視タイマ
    0x03,0x01,0x02,0x03 // テストデータ
};

const char bufD8400[] = {
    0x01,                // サブヘッダ
    0xff,                // PC番号（アクセス経路）
    0x0a,0x00,           // 監視タイマ
    0xD0,0x20,0x00,0x00, // 先頭デバイス番号
    0x20,0x44,           // デバイスコード
    0x02                // デバイス点数 
};

const char bufD100[] = {
    0x01,
    0xff,
    0x00,0x00,
    0x64,0x00,0x00,0x00,
    0x20,0x44,
    0x01,
    0x00
};

char bufM10[] = {
    0x00,                // サブヘッダ
    0xff,                // PC番号（アクセス経路）
    0x00,0x00,           // 監視タイマ
    0x0a,0x00,0x00,0x00, // 先頭デバイス番号
    0x20,0x4D,           // デバイスコード
    0x02,                // デバイス点数
    0x00, 
};

char bufM00Write[] = {
    0x03,                // サブヘッダ
    0xff,                // PC番号（アクセス経路）
    0x00,0x00,           // 監視タイマ
    0x64,0x00,0x00,0x00, // 先頭デバイス番号
    0x20,0x4D,           // デバイスコード
    0x01,                // デバイス点数 
    0x00,
};

char startPLC[] = {
    0x13,                // サブヘッダ
    0xff,                // PC番号（アクセス経路）
    0x00,0x00           // 監視タイマ      
};

char stopPLC[] = {
    0x14,                // サブヘッダ
    0xff,                // PC番号（アクセス経路）
    0x00,0x00           // 監視タイマ      
};


char getPLCName[] = {
    0x15,                // サブヘッダ
    0xff,                // PC番号（アクセス経路）
    0x00,0x00,
    0x00,          // 監視タイマ    
};